Revit 2026 API

# DeleteElements Properties

---

The DeleteElements type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from FailureResolution) |

#### Reference

DeleteElements Class

Autodesk.Revit.DB Namespace